cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/fuse'
tap 'homebrew/versions'

tap 'caskroom/versions'

brew 'zsh'
brew 'zsh-syntax-highlighting'

brew 'tmux'
brew 'reattach-to-user-namespace'

brew 'vim', args: ['override-system-vi']

# BSD tools, replace with Linux ones
brew 'bash'
brew 'emacs'
brew 'gpatch'
brew 'm4'
brew 'make'
brew 'nano'

# Other tools
brew 'less'
brew 'rsync'
brew 'svn'

# GNUutils here
brew 'binutils'
brew 'coreutils'
brew 'diffutils'
brew 'ed', args: ['with-default-names']
brew 'findutils', args: ['with-default-names']
brew 'gawk'
brew 'gnu-indent', args: ['with-default-names']
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']
brew 'gnu-which', args: ['with-default-names']
brew 'gnutls'
brew 'grep', args: ['with-default-names']
brew 'gzip'
brew 'screen'
brew 'watch'
brew 'wdiff', args: ['with-gettext']
brew 'wget'

brew 'ansible'
brew 'aws-shell'
brew 'awscli'
brew 'bazaar'
brew 'boost'
brew 'boost-python'
brew 'cheat'
brew 'cmake'
brew 'csshx'
brew 'ctags'
# We need this cask before encfs
cask 'osxfuse'
brew 'encfs'
brew 'fasd'
brew 'gist'
brew 'git'
brew 'go'
brew 'htop'
brew 'jq'
brew 'mercurial'
brew 'nvm'
brew 'protobuf'
brew 'pwgen'
brew 'python'
brew 'python3'
brew 'swift'
brew 'terraform'
brew 'thefuck'

cask '1password'
cask 'alfred'
cask 'alternote'
cask 'docker'
cask 'doxie'
cask 'evernote'
cask 'flux'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'gpgtools'
cask 'iterm2-beta'
cask 'little-snitch'
cask 'slack'
cask 'spectacle'
cask 'transmission'
cask 'vagrant'
cask 'virtualbox'
cask 'viscosity'
cask 'visual-studio-code'
cask 'vlc'
