cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/fuse'
tap 'homebrew/versions'

tap 'caskroom/versions'

brew 'zsh'
brew 'zsh-syntax-highlighting'

brew 'tmux'
brew 'reattach-to-user-namespace'

brew 'vim'

brew 'ansible'
brew 'aws-shell'
brew 'awscli'
brew 'bash'
brew 'bazaar'
brew 'boost'
brew 'boost-python'
brew 'cheat'
brew 'cmake'
brew 'coreutils'
brew 'csshx'
brew 'ctags'
brew 'encfs'
brew 'fasd'
brew 'findutils'
brew 'gawk'
brew 'gist'
brew 'git'
brew 'go'
brew 'grep'
brew 'htop'
brew 'jq'
brew 'mercurial'
brew 'protobuf'
brew 'pwgen'
brew 'python'
brew 'python3'
brew 'screen'
brew 'swift'
brew 'terraform'
brew 'thefuck'
brew 'watch'
brew 'wget'

cask 'doxie'
cask 'flux'
cask 'google-cloud-sdk'
cask 'iterm2-beta'
cask 'little-snitch'
cask 'spectacle'
cask 'transmission'
cask 'vagrant'
cask 'virtualbox'
cask 'viscosity'
cask 'vlc'
