cask_args appdir: '/Applications'

tap 'caskroom/versions'

brew 'zsh'
brew 'zsh-syntax-highlighting'

brew 'vim', args: ['override-system-vi']

# BSD tools, replace with Linux ones
brew 'bash'
brew 'emacs'
brew 'gpatch'
brew 'm4'
brew 'make'
brew 'nano'

# Other tools
brew 'less'
brew 'rsync'
brew 'svn'

# GNUutils here
brew 'binutils'
brew 'coreutils'
brew 'diffutils'
brew 'ed', args: ['with-default-names']
brew 'findutils', args: ['with-default-names']
brew 'gawk'
brew 'gnu-indent', args: ['with-default-names']
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']
brew 'gnu-which', args: ['with-default-names']
brew 'gnutls'
brew 'grep', args: ['with-default-names']
brew 'gzip'
brew 'screen'
brew 'watch'
brew 'wdiff', args: ['with-gettext']
brew 'wget'

brew 'cheat'
brew 'fasd'
brew 'gist'
brew 'git'
brew 'go'
brew 'htop'
brew 'jq'
brew 'pwgen'
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'swift'
brew 'terraform'
brew 'thefuck'

